T-NhanNguyen/ek-lm3s6965-bare-metal/include/lm3s6965/memory_map.h
#ifndef LM3S6965_MEMORY_MAP_H
#define LM3S6965_MEMORY_MAP_H

#include <stdint.h>

#define FLASH_BASE_ADDRESS         0x00000000u
#define FLASH_SIZE_BYTES           (256u * 1024u)
#define SRAM_BASE_ADDRESS          0x20000000u
#define SRAM_SIZE_BYTES            (64u * 1024u)
#define BITBAND_SRAM_ALIAS_BASE    0x22000000u
#define PERIPHERAL_BASE_ADDRESS    0x40000000u
#define BITBAND_PERIPHERAL_ALIAS_BASE 0x42000000u

#define WATCHDOG_BASE_ADDRESS      0x40000000u
#define GPIO_PORT_A_BASE_ADDRESS   0x40004000u
#define GPIO_PORT_B_BASE_ADDRESS   0x40005000u
#define GPIO_PORT_C_BASE_ADDRESS   0x40006000u
#define GPIO_PORT_D_BASE_ADDRESS   0x40007000u
#define GPIO_PORT_E_BASE_ADDRESS   0x40024000u
#define GPIO_PORT_F_BASE_ADDRESS   0x40025000u
#define GPIO_PORT_G_BASE_ADDRESS   0x40026000u
#define SSI0_BASE_ADDRESS          0x40008000u
#define UART0_BASE_ADDRESS         0x4000C000u
#define UART1_BASE_ADDRESS         0x4000D000u
#define UART2_BASE_ADDRESS         0x4000E000u
#define I2C0_BASE_ADDRESS          0x40020000u
#define I2C1_BASE_ADDRESS          0x40021000u
#define PWM_BASE_ADDRESS           0x40028000u
#define QEI0_BASE_ADDRESS          0x4002C000u
#define QEI1_BASE_ADDRESS          0x4002D000u
#define GPTM0_BASE_ADDRESS         0x40030000u
#define GPTM1_BASE_ADDRESS         0x40031000u
#define GPTM2_BASE_ADDRESS         0x40032000u
#define GPTM3_BASE_ADDRESS         0x40033000u
#define ADC0_BASE_ADDRESS          0x40038000u
#define ANALOG_COMPARATOR_BASE_ADDRESS 0x4003C000u
#define ETHERNET_BASE_ADDRESS      0x40048000u
#define HIBERNATION_BASE_ADDRESS   0x400FC000u
#define FLASH_CONTROL_BASE_ADDRESS 0x400FD000u
#define SYSTEM_CONTROL_BASE_ADDRESS 0x400FE000u

#define PRIVATE_PERIPHERAL_BASE_ADDRESS 0xE0000000u
#define ITM_BASE_ADDRESS           0xE0000000u
#define SYSTICK_BASE_ADDRESS       0xE000E010u
#define NVIC_BASE_ADDRESS          0xE000E100u
#define SCB_BASE_ADDRESS           0xE000E000u
#define TPIU_BASE_ADDRESS          0xE0040000u

#define REGISTER32(address) (*(volatile uint32_t *)(uintptr_t)(address))

#endif
